{"type": "root", "attrs": {}, "body": [{"level": 0, "type": "title", "indent": 0, "text": ["Introduction to the OD Houdini Shelf Tools"], "extent": [0, 47]}, {"type": "summary", "indent": 0, "text": ["A short introduction to the tools"], "extent": [47, 89]}, {"type": "para", "indent": 0, "text": ["The OD Houdini Shelftools started as a small collection of tools, that helped me be more efficient and endure less pain when I finally made the choice to switch from another DCC to Houdini."], "extent": [89, 280]}, {"type": "para", "indent": 0, "text": ["It has since grown to so much more.  ", {"type": "q", "text": ["Shelftools"]}, " doesnt really classify the collection anymore as it is an ever evolving toolset used by many artists around the world to make their workflow more efficient.  I would say one of its most popular tools is the material conversion, and while that tool alone can save you days of work, maybe even weeks over the run of a production, there are a lot of ", {"type": "q", "text": ["larger"]}, " tools that you should experiment with.  "], "extent": [280, 728]}, {"type": "para", "indent": 0, "text": ["The asset library is a corner stone.  In my humble opinion, having assets scattered around your drives is cool, but doesnt really help you much.  We all have 1000's of texture libraries, but, most of us, still go to google and search for a texture.  Why ? Because it is more convenient and visual.  "], "extent": [728, 1029]}, {"type": "para", "indent": 0, "text": ["That is where the asset library comes in, because whether its objects, or images, hdas, or vdbs, it lets you build catalogs and visualize all these assets and use them with ease."], "extent": [1029, 1209]}, {"type": "para", "indent": 0, "text": ["Dont forget the Drag and Drop from your desktop and the many, many benefits that feature provides."], "extent": [1209, 1309]}, {"type": "para", "indent": 0, "text": ["The project switcher is equally great, and its power lies in its simplicity. "], "extent": [1309, 1388]}, {"type": "para", "indent": 0, "text": ["That is what really all the tools are about.  Making your life simpler and more efficient.  I’ll invite you to try the various tools, dont just settle at one, but let the exploration take you on a wild ride."], "extent": [1388, 1597]}, {"type": "para", "indent": 0, "text": ["Last, but not least, I want to take a moment to acknowledge all users and supporters of ODTools.  I appreciate all your feedback, ideas and suggestions, comments, whether good or bad…. Keep it coming.  That is how the toolset grows."], "extent": [1597, 1833]}, {"type": "para", "indent": 0, "text": ["Enjoy the toolset and have fun with it."], "extent": [1833, 1874]}, {"type": "para", "indent": 0, "text": ["Oliver Hotz / \nOrigami Digital, LLC."], "extent": [1874, 1911]}], "title": ["Introduction to the OD Houdini Shelf Tools"], "summary": ["A short introduction to the tools"]}