{"type": "root", "attrs": {"type": "example"}, "body": [{"type": "title", "indent": 0, "text": ["BoxSpring"]}, {"type": "para", "indent": 0, "text": ["The Box SOP is used for more than just creating boxes. It can also envelop existing geometry for specific purposes. "], "extent": [0, 118]}, {"type": "para", "indent": 0, "text": ["The Box SOP can either create a simple six-sided polygon box, calculate the bounding box size for geometry, or be used in conjunction with the Lattice SOP."], "extent": [118, 275]}, {"type": "para", "indent": 0, "text": ["There are two objects within the box.hip file that are examples of this:"], "extent": [275, 349]}, {"type": "bullet_group", "body": [{"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "strong", "text": ["animated_bounding_box"]}], "extent": [349, 376], "body": [{"type": "para", "indent": 2, "text": ["The animated_bounding_box object shows how you can envelope an object and surround it with a simple box, even if it is animated. This can be useful when displaying complicated geometry, in which case you would put the display flag on the box object and the render flag on the complicated geometry."], "extent": [376, 677]}], "container": true}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "strong", "text": ["box_spring_lattice"]}], "extent": [677, 701], "body": [{"type": "para", "indent": 2, "text": ["This is an example, a Lattice SOP used in conjunction with the Box SOP. The Box SOP is used to envelope some geometry, in this case a sphere. Divisions is checked to create the proper geometry by referencing the number of divisions in the Lattice SOP. "], "extent": [701, 957]}], "container": true}], "container": true}, {"type": "para", "indent": 0, "text": ["The top points of the box are grouped by a Group SOP. The Spring SOP uses these points as the Fixed Points from which to create the deformation."], "extent": [957, 1103]}, {"type": "para", "indent": 0, "text": ["Using the Box SOP in this way allows you to change the incoming geometry (the basic_sphere in this case) and have the box and lattice automatically re-size for you."], "extent": [1103, 1268]}], "examplefor": "/nodes/sop/box", "examplefile": "/examples/nodes/sop/box/BoxSpring.otl"}