{"type": "root", "attrs": {"type": "node", "context": "vop", "tags": "rman,integrator", "icon": "NETWORKS/shop", "internal": "pxrvalidatebxdf", "version": "3.0", "namespace": null}, "body": [{"level": 0, "type": "title", "indent": 0, "text": ["pxrvalidatebxdf"], "extent": [71, 91]}, {"type": "para", "indent": 0, "text": ["This integrator serves mainly as a debugging tool to authors of Bxdf plugins. The 3 channels of the output are the luminance results for total hemispherical reflectance, computed in three different ways: the red channel gives the results of using the Bxdf’s GenerateSample method to sample the bxdf; the green channel gives the results of running the Bxdf’s EvaluateSample (or EvaluateSamplesAtIndex) method using the same generated samples, and only accumulating them if they agree with the values returned by GenerateSample; and the blue channel gives the results of integrating a set of hemispherical samples generated with a cosine weighting using the EvaluateSample method on the bxdf. Ideally, this will converge to the other two results. If the Bxdf is given 'white' values and is correct, the resulting image should converge to all white pixels. Energy lost (either due to explicit absorption or due to the bxdf model losing energy) or gained shows up as non-white pixels. Bxdf authors should take care to observe what happens at grazing angles, as that can be a good place to lose energy."], "extent": [91, 1191]}, {"level": 1, "id": "parameters", "container": true, "type": "parameters_section", "indent": 0, "role": "section", "extent": [1191, 1203], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["numSamples"], "extent": [1203, 1220], "body": [{"type": "para", "indent": 7, "text": ["Controls the number of Bxdf samples to generate and evaluate per ray. The default is 4."], "extent": [1249, 1345]}], "container": true, "attrs": {"channel": "/numSamples"}, "role": "item"}], "container": true, "role": "item_group"}], "text": "Parameters"}], "title": ["pxrvalidatebxdf"]}